const extraReferences = [
    // existing references
    {
        summary: "通灵",
        paragraphs: [
        "&#10022;通灵：“通灵宝玉”的简称。亦即女娲炼石补天所剩的“顽石”。因其历经锻炼而“灵性已通”，故称。​",
        ],
    },
    {
        summary: "《石头记》",
        paragraphs: [
        "&#10022;《石头记》：此书的本名。因记述女娲炼石补天所剩的那块“顽石”幻化为贾宝玉在人间经历的故事，故称。",
        ],
    },
    {
        summary: "风尘碌碌",
        paragraphs: [
        "&#10022;风尘碌碌(fēng chén lù lù)：形容在旅途上辛苦忙碌的样子。",
        "&#10022;语出明·金毓峒《金鹤冲诗·按部泾原韩国主招宴暧泉二首（其一）》：风尘碌碌惜年华，选胜陪游帝子家。",
        ],
    },
    {
        summary: "一事无成",
        paragraphs: [
        "&#10022;一事无成(yī shì wú chéng)：原意为一样事情也没有做成。形容什么事情都做不成，毫无成就。",
        "&#10022;语出唐·白居易《除夜寄微之》：鬓毛不觉白毵毵，一事无成百不堪。",
        ],
    },
    {
        summary: "无可如何",
        paragraphs: [
        "&#10022;无可如何(wú kě rú hé)：没有什么办法。",
        "&#10022;语出明·李贽《复邓鼎石书》：虽知情不容己，然亦无可如何。",
        ],
    },
    {
        summary: "纨袴",
        paragraphs: [
        "&#10022;纨袴(wán kù)：原意为细绢制的裤子。泛指华美的衣着。借指富贵人家子弟。",
        "&#10022;《汉书·叙传上》：“数年，金华之业绝，出与王、许子弟为群，在于绮襦纨裤之间，非其好也。”颜师古注：“纨，素也。绮，今细绫也。并贵戚子弟之服。”。",
        "&#10022;唐·杜甫《奉赠韦左丞丈二十二韵》：纨袴不饿死，儒冠多误身。",
        ],
    },
    {
        summary: "饫甘餍肥",
        paragraphs: [
        "&#10022;饫甘餍肥(yù gān yàn féi)：原意为饱食肥美的食品。形容生活优裕、奢侈。",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "历历",
        paragraphs: [
        "&#10022;历历(lì lì)：景、物、人等清晰分明。",
        "&#10022;《古诗十九首·明月皎夜光》：玉衡指孟冬，众星何历历。",
        ],
    },
    {
        summary: "不肖",
        paragraphs: [
        "&#10022;不肖(bù xiào)：不成材、没有才能。",
        "&#10022;《礼记·射义》：“发而不失正鵠者，其唯贤者乎？若夫不肖之人，则彼将安能以中。”孔颖达疏：“不肖，谓小人也。”。",
        ],
    },
    {
        summary: "蓬牖茅椽",
        paragraphs: [
        "&#10022;蓬牖茅椽(péng yǒu máo chuán)：原意为用蓬草编窗，用茅草做椽子。形容住屋简陋，生活清贫。",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "绳床瓦灶",
        paragraphs: [
        "&#10022;绳床瓦灶(shéng chuáng wǎ zào)：形容起居用具简陋，生活清贫。",
        "&emsp;&#10020;绳床：是一种用绳子将木板穿连而成并可折叠的简单坐具，故又称“交床”、“交椅”。因其学自胡人，故亦称“胡床”。",
        "&emsp;&#10020;瓦灶：指烧饭用的粗陶器和土灶台。",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "荒唐",
        paragraphs: [
        "&#10022;荒唐(huāng táng)：原意为广大，不着边际。引申为思想、言行不符合常理人情、夸大不实或荒谬无理，使人感到离奇。",
        "&#10022;《庄子·天下》：“以谬悠之说，荒唐之言，无端崖之辞，时恣纵而不傥，不以觭见之也。”成玄英疏：“荒唐，广大也。”。",
        "&#10022;唐·韩愈《桃源图》诗：神仙有无何眇芒，桃源之说诚荒唐。",
        ],
    },
    {
        summary: "女娲氏炼石补天",
        paragraphs: [
        "&#10022;女娲氏炼石补天：上古神话传说，事见《列子·汤问》、《淮南子·览冥训》、《太平御览·卷七八·女娲氏》。",
        "&#10022;传说大意：相传女娲是伏羲之妹，兄妹结为夫妻，产生人类；女娲又以黄土造人，使人类大量增加。不料天崩地裂，大火熊熊，洪水泛滥，野兽横行，生民面临灭顶之灾。于是女娲挺身而出，炼五色石以补苍天，折四条鳌足以为天柱，才避免了这场浩劫。​",
        ],
    },
    {
        summary: "大荒山无稽崖",
        paragraphs: [
        "&#10022;大荒山：语或本《山海经·大荒西经》：大荒之中，有山名曰大荒之山，日月所出入……是谓大荒之野。",
        "&#10022;无稽崖：曹雪芹杜撰的地名。​",
        "&#10148;[注解]：寓意此书中故事荒诞无稽。",
        ],
    },
    {
        summary: "青埂峰",
        paragraphs: [
        "&#10148;[注解]：“青埂”谐音为“情根”，寓意贾宝玉的多情。",
        ],
    },
    {
        summary: "扇坠",
        paragraphs: [
        "&#10148;[注解]：扇柄下端系的装饰物，一般用玉、石、珊瑚、玛瑙、象牙、香木等雕成，长不足寸，精致小巧。",
        ],
    },
    {
        summary: "簪缨",
        paragraphs: [
        "&#10022;簪缨(zān yīng)：古代达官贵人的冠饰。代指高官贵人。",
        "&#10022;南朝·梁·萧统《锦带书十二月启·姑洗三月》：龙门退水，望冠冕以何年？鹢路颓风，想簪缨于几载？",
        "&emsp;&#10020;鹢路：比喻失意的仕途或不利的处境。",
        "&emsp;&#10020;《左传·僖公十六年》：“六鹢退飞，过宋都。”杜预注：“鹢，水鸟。高飞遇风而退，宋人以为灾。”。",
        ],
    },
    {
        summary: "花柳",
        paragraphs: [
        "&#10022;花柳(huā liǔ)：指繁华游乐之地。",
        "&#10022;唐·李白《流夜郎赠辛判官》诗：昔在长安醉花柳，五侯七贵同杯酒。",
        ],
    },
    {
        summary: "空空",
        paragraphs: [
        "&#10022;空空(kōng kōng)：佛教用语。佛教谓一切皆空而又不执着于空名与空见。",
        "&#10022;《大品般若经·如化品》：以空空，故空。不应分别是空、是化。",
        ],
    },
    {
        summary: "大士",
        paragraphs: [
        "&#10022;大士(dà shì)：佛教对菩萨的通称。",
        "&#10022;唐·湛然《法华文句记》卷二：大士者，《大论》称菩萨为大士，亦曰开士。",
        ],
    },
    {
        summary: "真人",
        paragraphs: [
        "&#10022;真人(zhēn rén)：道家称存养本性或修真得道的人。亦泛称“成仙”之人。",
        "&#10022;《庄子·大宗师》：古之真人，其寝不梦，其觉无忧，其食不甘，其息深深……古之真人，不知说生，不知恶死，其出不欣，其入不距；翛然而往，翛然而来而已矣",
        "&emsp;&#10020;说(yuè)：古同‘悦’，高兴、愉快。",
        "&#10022;真人(zhēn rén)：佛教称证真理的人，即阿罗汉。",
        "&#10022;唐·玄应《一切经音义》卷八：真人，是阿罗汉也。或言阿罗诃。经中或言应真，或作应仪，亦云无著果，皆是一也。",
        ],
    },
    {
        summary: "红尘",
        paragraphs: [
        "&#10022;红尘(hóng chén)：佛教、道教等称人世为“红尘”。常指俗世、繁华热闹的地方",
        "&#10022;南朝陈·徐陵〈洛阳道〉诗二首之一：绿柳三春暗，红尘百戏多。",
        ],
    },
    {
        summary: "彼岸",
        paragraphs: [
        "&#10022;彼岸(bǐ àn)：佛教语。佛家以有生有死的境界为“此岸”；超脱生死，即涅槃的境界为“彼岸”。",
        "&#10022;《文选·王巾·头陁寺碑文》：彼岸者，引之于有，则高谢四流；推之于无，则俯弘六度。",
        ],
    },
    {
        summary: "野史",
        paragraphs: [
        "&#10022;野史(yě shǐ)：与“官史”、“正史”相对。原指私人记载轶闻琐事的文字。引申以指小说之类的作品。",
        "&#10022;唐·陆龟蒙〈奉酬袭美苦雨见寄〉诗：自爱垂名野史中，宁论抱困荒城侧。",
        ],
    },
    {
        summary: "文君",
        paragraphs: [
        "&#10022;文君(wén jūn)：指卓文君。后借指美人，亦比喻寡妇。",
        "&#10022;汉代临邛富翁卓王孙之女，容貌美丽，才学优长，而夫死寡居。司马相如饮于卓氏，以琴曲挑之，卓文君即与之私奔，遂为夫妻。",
        "&#10022;《史记·司马相如列传》：是时卓王孙有女文君新寡，... 文君乃与相如归成都，买田宅，为富人。",
        ],
    },
    {
        summary: "子建",
        paragraphs: [
        "&#10022;子建(zǐ jiàn)：指曹植，字子建。三国魏武帝曹操第四子，著名才子。后以指文才出众之人。",
        "&#10022;《南史·谢灵运传》：谢灵运曰：“天下才共一石：曹子建独得八斗，我得一斗，自古及今共用一斗。”遂有“八斗之才”的美誉。",
        "&#10022;又《魏志》(见《太平御览》)：文帝(曹丕)尝欲害植，以其无罪，令植七步为诗，若不成，加军法。植即应声曰：“煮豆燃豆萁，豆在釜中泣。本是同根生，相煎何太急！”文帝善之。遂又有“七步之才”的美誉。​",
        ],
    },
    {
        summary: "之乎者也",
        paragraphs: [
        "&#10022;之乎者也(zhī hū zhě yě)：文言虚词，古代汉语中常用的四个助词。原意指浅近的字眼或文章，后常用来形容咬文嚼字、迂腐的书呆子气。",
        "&#10022;语出宋·文莹《湘山野录》中卷：之乎者也，助得甚事？",
        ],
    },
    {
        summary: "离合悲欢",
        paragraphs: [
        "&#10022;离合悲欢(lí hé bēi huān)：泛指别离、团聚、悲哀、喜悦的种种遭遇和心态。",
        "&#10022;语出明·陆采《明珠记·提纲》：佳人才子古难并，苦离分，巧完成，离合悲欢只在眼前生。",
        ],
    },
    {
        summary: "谋虚逐妄",
        paragraphs: [
        "&#10022;谋虚逐妄(móu xū zhú wàng)：追求不存在、不真实或不合理的事物。",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "省",
        paragraphs: [
        "&#10022;省(xǐng)：即“晨省”，指子女早晨向父母请安问候的礼节。​",
        "&#10022;典出《礼记·曲礼上》：凡为人子之礼，冬温而夏凊，昏定而晨省。​",
        ],
    },
    {
        summary: "《情僧录》",
        paragraphs: [
        "&#10022;《情僧录》：《红楼梦》的别名之一。​",
        "&#10148;[注解]：作者借空空道人因看此书而悟彻了空、色、情，说明“情”的虚幻。",
        ],
    },
    {
        summary: "《风月宝鉴》",
        paragraphs: [
        "&#10022;《风月宝鉴》：《红楼梦》的别名之一。​",
        "&emsp;&#10020;风月：指男女之情。",
        "&#10022;风月宝鉴是太虚幻境警幻仙姑所造的一面宝镜，从正面看到的是美人，从反面看到的是骷髅，隐寓美人即骷髅。",
        "&#10148;[注解]：作者以《风月宝鉴》为书名，是欲告诫人们要打破情关，跳出情海。",
        ],
    },
    {
        summary: "《金陵十二钗》",
        paragraphs: [
        "&#10022;《金陵十二钗》：《红楼梦》的别名之一。​",
        "&#10022;因本书是为十二位金陵籍女子(即太虚幻境“金陵十二钗正册”中的女子)立传，故称。",
        ],
    },
    {
        summary: "地陷东南",
        paragraphs: [
        "&#10022;地陷东南：古代神话传说，事见《淮南子·天文训》。",
        "&#10022;传说大意：共工与颛顼争夺帝位，怒而触不周山，致使东南大地塌陷下沉，所以世界东南低而西北高。",
        ],
    },
    {
        summary: "西方",
        paragraphs: [
        "&#10022;西方：指佛家理想中的西方极乐世界，即所谓“佛国”，又称“西方净土”、“西方净国”、“西方世界”、“极乐土”。​",
        "&#10022;《佛说阿弥陀经》：从是西方，过十万亿佛土，有世界名曰极乐……彼土何故名为极乐？其国众生无有众苦，但受诸乐，故名极乐。",
        ],
    },
    {
        summary: "灵河",
        paragraphs: [
        "&#10022;灵河：佛国中的河。",
        "&#10022;佛经中说因龙住于河中，永不枯竭，故又称“龙泉”。",
        ],
    },
    {
        summary: "三生石",
        paragraphs: [
        "&#10022;三生石(sān shēng shí)：比喻因缘前定，象征情定三生。",
        "&#10022;典出唐·袁郊《甘泽谣·圆观》：僧人圆观与友人李源同游三峡，见几个妇人在汲水，圆观对李源说：“其中孕妇姓王者，是某(我)托生之所。”并相约十二年后的中秋之夜在杭州天竺寺外相见。是夜圆观即死。李源虽觉怪异，还是如期而至，只见一牧童高唱《竹枝词》曰：“三生石上旧精魂，赏月吟风不要论。惭愧情人远相访，此身虽异性长存。”李源才知圆观果已转生为牧童。",
        "&emsp;&#10020;三生：佛教用语。佛家认为人的灵魂不灭，轮回转世，每转生一次即为一生，故将前生、今生、来生谓之“三生”。",
        ],
    },
    {
        summary: "甘露",
        paragraphs: [
        "&#10022;甘露(gān lù)：一种特殊的、甘美的露水。古人认为是天地的精华，被视为太平的祥瑞。",
        "&#10022;典出《老子》第三二章：天地相合，以降甘露。",
        "&#10022;明·李时珍《本草纲目·水部一·甘露》(释文)引《瑞应图》：甘露，美露也。神灵之精，仁瑞之泽，其凝如脂，其甘如饴，故有甘、膏、酒、浆之名​。",
        ],
    },
    {
        summary: "离恨天",
        paragraphs: [
        "&#10022;离恨天(lí hèn tiān)：原意指传说中三十三层天最高的离恨天。后比喻男女相恋而不能遂愿，抱恨终身的境地。",
        "&#10022;元·吴昌龄《张天师·第二折》：小生陈世英，便好道三十三天离恨天最高，四百四病相思病最苦。",
        ],
    },
    {
        summary: "度脱",
        paragraphs: [
        "&#10022;度脱(dù tuō)：佛教和道教用语。指超度世人脱离有生有死的苦难，达到脱离生死的涅槃或神仙的境界。",
        "&#10022;唐·白居易〈自觉〉诗二首之二：斗擞垢秽衣，度脱生死轮。",
        ],
    },
    {
        summary: "功德",
        paragraphs: [
        "&#10022;功德(gōng dé)：佛教用语。泛指念佛、诵经、布施、度人出家等佛事。亦泛指做好事、行善事。",
        "&#10022;《大乘义章·十功德义三门分别》：功谓功能，能破生死，能得涅槃，能度众生，名之为功。此功是其善行家德，故云功德。",
        ],
    },
    {
        summary: "因果",
        paragraphs: [
        "&#10022;因果(yīn guǒ)：佛教用语。指事物的起因和结果，今生的善恶，可以影响未来的善恶果报。",
        "&#10022;《涅槃经·遗教品一》：善恶之报，如影随形，三世因果，循环不失。",
        ],
    },
    {
        summary: "火坑",
        paragraphs: [
        "&#10022;火坑(huǒ kēng)：佛教用语。原指佛教轮回六道中的后三道畜生道、饿鬼道、地狱道。后比喻痛苦的境地，泛指人世间的苦难。",
        "&emsp;&#10020;六道：佛教认为众生轮回有六道，即天道、人道、阿修罗道、畜生道、饿鬼道、地狱道。",
        "&#10022;《法华经·普门品》：假使兴害意，推落大火坑。念彼观音力，火坑变成池。",
        ],
    },
    {
        summary: "一面之缘",
        paragraphs: [
        "&#10022;一面之缘(yī miàn zhī yuán)：指有能见一面的缘分。比喻机会难得。",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "太虚",
        paragraphs: [
        "&#10022;太虚(tài xū)：指虚无飘渺的太空。",
        "&#10022;语出自《庄子·知北游》：是以不过乎昆仑，不游乎太虚。",
        ],
    },
    {
        summary: "幻境",
        paragraphs: [
        "&#10022;幻境(huàn jìng)：指虚幻、不真实的境界。",
        "&#10022;语自唐·王维《为兵部祭库部王郎中文》：深悟幻境，独与道游。",
        ],
    },
    {
        summary: "疯疯癫癫",
        paragraphs: [
        "&#10022;疯疯癫癫(fēng fēng diān diān)：精神失常的样子。形容人言语行动轻狂或超出常态。​",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "有命无运",
        paragraphs: [
        "&#10022;有命无运(yǒu mìng wú yùn)：指人虽有好的禀赋、天赋，却无好的机遇，故将终生坎坷。",
        "&emsp;&#10020;命，运：古人认为人的先天禀赋的贵贱寿夭为“命”，而现实生活中的遭遇为“运”。",
        ],
    },
    {
        summary: "三劫",
        paragraphs: [
        "&#10022;三劫(sān jié)：佛教用语。“三阿僧祇劫”的省略。指菩萨修成正果所需的时间。泛指极长的时间。​",
        "&#10022;晋·法显《佛国记》：菩萨从三阿僧祇劫，苦行不惜身命。",
        ],
    },
    {
        summary: "北邙山",
        paragraphs: [
        "&#10022;北邙山(běi máng shān)：又作“北芒山”。本名邙山，因在洛阳之北，故名。东汉、魏、晋时王侯公卿多葬于此，后世即成为墓地的代称。​",
        "&#10022;唐·王建〈北邙行〉：北邙山头少闲土，尽是洛阳人旧墓。",
        ],
    },
    {
        summary: "表字",
        paragraphs: [
        "&#10022;表字(biǎo zì​)：旧时人在本名以外所起的表示德行或本名的意义的名字。",
        "&emsp;&#10020;古代男子20岁女子15岁，不便直呼其名。故另取一与本名涵义相关的别名，称之为字，以表其德。",
        "&#10022;宋·张世南《游宦纪闻》：昔人有诫后生不可称前辈表字，此忠厚之至也。然一时出于中心至诚，未尝深考。字所以表德也，古人以为美称，殷人以为讳，事神而后有字。",
        ],
    },
    {
        summary: "眉目清秀",
        paragraphs: [
        "&#10022;眉目清秀(méi mù qīng xiù)：语本“眉清目秀”。形容人容貌清俊秀丽，漂亮而不俗气。​",
        "&#10022;语出元·李直夫《合同文学》第一折：有个孩儿唤做安住，今年三岁，生得眉清目秀，是好一个孩儿也。",
        ],
    },
    {
        summary: "三生愿",
        paragraphs: [
        "&#10022;三生愿(sān shēng yuàn)：指世世结为夫妻的愿望。",
        "&#10022;明·汪廷讷《种玉记·笺允》：那更神凝秋水，貌比芳莲，堪遂我三生愿。",
        "&emsp;&#10020;三生：佛教用语。佛家认为人的灵魂不灭，轮回转世，每转生一次即为一生，故将前生、今生、来生谓之“三生”。",
        ],
    },
    {
        summary: "自顾风前影",
        paragraphs: [
        "&#10022;自顾风前影：化用“顾影自怜”。意谓看着自己的身影也觉可爱、怜惜。原形容孤独失意，现表示自我欣赏。",
        "&#10022;典出晋·陆机《赴洛道中作二首》其一：伫立望故乡，顾影凄自怜。",
        ],
    },
    {
        summary: "月下俦",
        paragraphs: [
        "&#10022;月下俦：原意为“月下老人指配的伴侣”，指个人的婚姻、伴侣​。",
        "&#10022;典出唐·李复言《续玄怪录·定婚店》：杜陵韦固，少孤，思早娶妇，多歧求婚，必无成而罢。元和二年，将游清河，旅次宋城南店。...斜月尚明，有老人倚布囊坐于阶上，向月捡书。...因问囊中何物？曰：“赤绳子耳，以系夫妻之足。及其生，则潜用相系。虽雠敌之家，贵贱悬隔，天涯从宦，吴楚异乡，此绳一系，终不可逭。君之脚已系于彼矣，他求何益？”。",
        "&#10022;典出大意：唐人韦固夜过宋城，见一老翁在月下翻看簿册，问之，才知是婚姻簿子。老翁并携赤绳，言其一旦用此赤绳系住一男一女之足，二人必成夫妻。",
        "&emsp;&#10020;月下：即“月下老人”，传说中主管人间婚姻的神仙。简称“月下老”、“月老”。",
        ],
    },
    {
        summary: "蟾光",
        paragraphs: [
        "&#10022;蟾光(chán guāng)：即“月色”；“月光”，因相传月宫中有蟾蜍，故称​。",
        "&#10022;南朝梁·萧统唐·徐敞〈圆灵水镜〉诗：练色临窗牖，蟾光霭户庭。",
        "&emsp;&#10020;练色(liàn sè)：白色。",
        "&#10022;暗用“蟾宫折桂(chán gōng zhé guì)”：比喻旧时科举时代，考生应考得中、科举及第、金榜题名​。",
        "&#10022;语出《晋书·郤诜传》：武帝于东堂会送，问诜曰：“卿自以为如何？”诜对曰：“臣举贤良封策，为天下第一，犹桂林之一枝，昆山之片玉。”​。",
        "&emsp;&#10020;唐人将“折桂”之“桂”傅会为神话传说中月宫之“桂”，遂产生了“蟾宫折挂”这一成语。",
        "&emsp;&#10020;事见宋·叶梦得《避暑录话》卷下：世以登科为“折桂”，此谓郤诜对策东堂，自云“桂林一枝”也。自唐以来用之……其后以月中有桂，故又谓之“月桂”。而月中又言有蟾，故又改桂为蟾，以登科为“登蟾宫”。",
        ],
    },
    {
        summary: "玉在椟中求善价",
        paragraphs: [
        "&#10022;玉在椟中求善价：原意为希望匣子里的玉石能卖个好价钱。比喻怀才待用或待时出山的人。",
        "&#10022;典出《论语·子罕》：子贡曰：“有美玉于斯，韫椟而藏诸？求善贾而沽诸？”子曰：“沽之哉，沽之哉！我待贾者也。”。",
        ],
    },
    {
        summary: "钗于奁内待时飞",
        paragraphs: [
        "&#10022;钗于奁内待时飞：原意为匣子里的玉钗化为白燕飞走。比喻有才能的人等待合适的时机，将来定能仕途得意，飞黄腾达。",
        "&#10022;典出汉·郭宪《洞冥记》卷二：元鼎元年，起招仙阁于甘泉宫西。...有青鸟，赤头，道路而下，以迎神女。神女留玉钗以赠帝，帝以赐赵婕妤。至昭帝元凤中，宫人犹见此钗。黄諃欲之，明日示之，既发匣，有白燕飞升天。后宫人学作此钗，因名玉燕钗，言吉祥也。",
        "&#10022;典故大意：汉武帝元鼎元年，宫中起造招仙阁，有神女以玉钗赠汉武帝，帝赐与赵婕妤。至汉昭帝元凤年间，黄諃想得到此玉钗，将匣子打开时，玉钗化白燕飞去。",
        ],
    },
    {
        summary: "芹意",
        paragraphs: [
        "&#10022;芹意(qín yì)：谦辞。代指菲薄的礼物，或微薄的心意。",
        "&#10022;典出《列子·杨朱》：昔人有美戎菽，甘枲茎芹萍子者，对乡豪称之。乡豪取而尝之，蜇于口，惨于腹，众哂而怨之，其人大惭。",
        "&#10022;典故大意：从前有人觉得芹菜味美，即向乡绅推荐并称赞，乡绅一尝，味道却很差，胃里也不舒服，在场的人都抱怨他，使他十分羞惭。",
        ],
    },
    {
        summary: "飞觥献斝",
        paragraphs: [
        "&#10022;飞觥献斝(fēi gōng xiàn jiǎ)：形容酒席间频频举杯、互相劝饮的热闹景象。",
        "&#10022;典出《红楼梦》。",
        ],
    },
    {
        summary: "大比",
        paragraphs: [
        "&#10022;大比(dà bǐ)：隋、唐以后科举考试的泛称。以其为全国考生参加的考试，故称。",
        "&#10148;[注解]：明、清时代的科举考试每三年举行一轮，分为三级：​",
        "&emsp;&#10020;头一年为院考，考生为府、县童生，考取者为生员，通称秀才；",
        "&emsp;&#10020;次年为乡试，考生为一省的生员(秀才)和在国子监肄业的监生，考取者为举人；",
        "&emsp;&#10020;第三年为会试，考生为全国的举人，考取者为贡士，贡士再经殿试考中者为进士。",
        ],
    },
    {
        summary: "黄道",
        paragraphs: [
        "&#10022;黄道(huáng dào)：即“黄道之日”。指做事会吉祥、平安的日子。",
        "&#10022;《协纪辨方书·卷七·黄道黑道》：青龙、明堂、金匮、天德、玉堂、司命，皆月内天黄道之神也。所值之日，皆宜兴众务，不避太岁、将军、月刑，一切凶恶自然避之。",
        ],
    },
    {
        summary: "红日三竿",
        paragraphs: [
        "&#10022;红日三竿(hóng rì sān gān)：太阳高升，照地有三竹竿高。形容天已经大亮，时间已经不早。",
        "&#10022;语出《南齐书·天文志上》：日出高三竿，朱色赤黄，日晕。",
        ],
    },
    {
        summary: "黑道",
        paragraphs: [
        "&#10022;黑道(hēi dào)：即“黑道日”。指做事会遭受灾祸、面临危险的日子。",
        "&#10022;《协纪辨方书·卷七·黄道黑道》：天刑、朱雀、白虎、天牢、元武、勾陈者，月中黑道也。所理之方，所值之日，皆不可兴土功、营屋舍、移徙、远行、嫁娶、出军。",
        ],
    },
    {
        summary: "接二连三",
        paragraphs: [
        "&#10022;接二连三(hēi dào)：一个接着一个，连续不断。",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "牵五挂四",
        paragraphs: [
        "&#10022;牵五挂四(hēi dào)：一个连着一个，接连不断。",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "狼狈",
        paragraphs: [
        "&#10022;狼狈(láng bèi)：语本“狼跋”，指老狼行走时，前进会踩到脖子下面的肉，后退会踩到尾巴，因此行走困难。比喻困顿、窘迫，进退两难的样子。",
        "&#10022;语出《诗经·豳风·狼跋》云：狼跋其胡，载疐其尾。公孙硕肤，其舄几几。狼疐其尾，载跋其胡。公孙硕肤，德音不瑕。毛传云：“跋，躐；疐，跲也。老狼有胡，进则躐其胡，退则跲其尾，进退有难，然而不失其猛。”。",
        "&emsp;&#10020;朱熹集注：胡，颔下悬肉。",
        ],
    },
    {
        summary: "衣食之计",
        paragraphs: [
        "&#10022;衣食之计(yī shí zhī jì)：语或本“衣食之谋”，指维持生活的计划、办法。",
        "&#10022;语出宋·陆游《谢参政启》：比坐啼号之迫，浪为衣食之谋。投檄无缘，强颜可笑。",
        ],
    },
    {
        summary: "稼穑",
        paragraphs: [
        "&#10022;稼穑(jià sè)：春耕为“稼”，秋收为“穑”。泛指农业劳动。",
        "&#10022;《书·无逸》：厥父母勤劳稼穑，厥子乃不知稼穑之艰难。",
        ],
    },
    {
        summary: "好吃懒做",
        paragraphs: [
        "&#10022;好吃懒做(hào chī lǎn zuò)：指贪于吃喝，却懒于做事。形容人贪图享乐，不肯劳动。",
        "&#10022;语出明·兰陵笑笑生《金瓶梅词话》第七回：为女妇人家，好吃懒做，嘴大舌长，招是惹非，不打他，打狗不成！",
        ],
    },
    {
        summary: "贫病交攻",
        paragraphs: [
        "&#10022;贫病交攻(pín bìng jiāo gōng)：指贫困和疾病同时困扰一个人。形容生活境况极端困难。",
        "&#10022;语出宋·陈亮《与王季海丞相书》：入春以来，贫病交攻，更无一日好况。",
        ],
    },
    {
        summary: "鹑衣",
        paragraphs: [
        "&#10022;鹑衣(chún yī)：原意指鹑的羽毛制成的衣服。喻指缝补的破旧衣衫。",
        "&#10022;典出《荀子·大略》：子夏贫，衣若县鹑。",
        "&emsp;&#10020;县：通“悬”，挂、吊在空中。",
        ],
    },
    {
        summary: "笏满床",
        paragraphs: [
        "&#10022;笏满床：原意指窗上放满了做官的手板。喻指做官的人多，形容满门为官。",
        "&#10022;典出《旧唐书·崔神庆传》：开元中，神庆子琳等皆至大官，群从数十人，趋奏省闼。每岁时家宴，以一榻置笏，重叠于其上。",
        ],
    },
    {
        summary: "陇头",
        paragraphs: [
        "&#10022;陇头(lǒng tóu)：指坟墓。",
        "&#10022;《礼记·曲礼上》：适墓不登垄。郑玄注：“垄，冢也。”​。",
        ],
    },
    {
        summary: "膏粱",
        paragraphs: [
        "&#10022;膏粱(gāo liáng)：原意为肥肉和细粮。泛指肥美的食物。借指富贵人家子弟。",
        "&#10022;《孟子·告子上》：诗云：“既醉以酒，既饱以德。言饱乎仁义也，所以不愿人之膏粱之味也。”。",
        "&#10022;《新唐书·卷九五·高俭传》：先宗室，后外戚；退新门，进旧望；右膏粱，左寒畯。",
        ],
    },
    {
        summary: "强梁",
        paragraphs: [
        "&#10022;强梁(qiáng liáng)：原指为人强横凶暴，胡作非为。引申为强盗。",
        "&#10022;典出《墨子·鲁问》：譬有人于此，其子强梁不材，故其父笞之，其邻家之父举木而击之​。",
        ],
    },
    {
        summary: "紫蟒",
        paragraphs: [
        "&#10022;紫蟒(zǐ mǎng)：原指绣蟒紫袍。以其为旧时高官之礼服，故借喻高官。",
        "&#10022;《明史·舆服三》说：按《大政记》，永乐以后，宦官在帝左右，必蟒服，制如曳撒，绣蟒于左右，……”",
        ],
    },
    {
        summary: "面善",
        paragraphs: [
        "&#10022;面善(miàn shàn)：面貌熟识，即面熟。",
        "&#10022;《礼记·学记》：不陵节而施之谓孙(逊)，相观而善之谓摩。孔颖达疏：“善，犹解也。”。",
        ],
    },
    {
        summary: "目瞪口呆",
        paragraphs: [
        "&#10022;目瞪口呆(mù dèng kǒu dāi)：眼睛大睁，张嘴说不出话来。形容因恐惧而失神发愣的样子。",
        "&#10022;语出元·无名氏《赚蒯通》第一折：吓得项王目瞪口呆，动弹不得。",
        ],
    }
    
    // new references
]
