const extraReferences = [
    // existing references
    {
        summary: "邸报",
        paragraphs: [
        "&#10022;邸报(dǐ bào)：亦称“邸抄”、“抄报”、“宫门抄”，清代或称“京报”。中国古代官方报纸的通称。",
        "&#10148;[注解]：承办者或为地方官府驻京办事机构，或为朝廷。邸报专门抄发诏令、奏章及朝政新闻，以供地方官及时了解。",
        ],
    },
    {
        summary: "天缘凑巧",
        paragraphs: [
        "&#10022;天缘凑巧(tiān yuán còu qiǎo)：旧时认为男女结成夫妻是天意所配合。也指事属巧合。",
        "&#10022;语出元·石子章《竹坞听琴》第四折：这婚姻是天缘凑巧。",
        ],
    },
    {
        summary: "贱荆",
        paragraphs: [
        "&#10022;贱荆(jiàn jīng)：亦称“拙荆”、“山荆”等。谦词。对人称自己的妻子。",
        "&emsp;&#10020;荆：“荆钗布裙”的省称。形容妇人极为简朴的服饰。",
        "&#10022;语出汉·刘向《列女传》(见《太平御览》卷七一八引)：梁鸿妻孟光，荆钗布裙。",
        ],
    },
    {
        summary: "尽心图报",
        paragraphs: [
        "&#10022;尽心图报(jìn xīn tú bào)：比喻竭尽所有的心思、谋划报答别人。",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "打恭",
        paragraphs: [
        "&#10022;打恭(dǎ gōng)：弯下身子作揖、行礼。表示恭敬。轻于跪拜的一种礼节。",
        "&#10022;《喻世明言·卷一〇·滕大尹鬼断家私》：将欲进门，忽然对著空中，连连打恭，口里应对，恰像有主人相迎的一般。",
        ],
    },
    {
        summary: "不屑",
        paragraphs: [
        "&#10022;不屑(bù xiè)：形容对某事物非常轻视，不值得。",
        "&#10022;语出《诗·鄘风·君子偕老》：鬓发如云，不屑髢也。",
        ],
    },
    {
        summary: "膏粱",
        paragraphs: [
        "&#10022;膏粱(gāo liáng)：原意为肥肉和细粮。泛指肥美的食物。借指富贵人家子弟。",
        "&#10022;《孟子·告子上》：诗云：“既醉以酒，既饱以德。言饱乎仁义也，所以不愿人之膏粱之味也。”。",
        "&#10022;《新唐书·卷九五·高俭传》：先宗室，后外戚；退新门，进旧望；右膏粱，左寒畯。",
        ],
    },
    {
        summary: "唯唯听命",
        paragraphs: [
        "&#10022;唯唯听命(wéi wéi tīng mìng)：是命令就服从，不敢有半点违抗。形容绝对服从。",
        "&#10022;语出春秋·左丘明《左传·昭公十二年》：孤不天，不能事君，使君怀怒以及敝邑，孤之罪也。敢不唯命是听。",
        ],
    },
    {
        summary: "内顾之忧",
        paragraphs: [
        "&#10022;内顾之忧(nèi gù zhī yōu)：形容对家事或国事的顾念而担忧。后多指家庭需要照顾的人或事。​",
        "&#10022;语出北朝魏·袁翻《安置蠕蠕表》：且蠕蠕尚存，则高车犹有内顾之忧，未暇窥窬上国；若蠕蠕全灭，则高车跋扈之计，岂易可知？",
        "&emsp;&#10020;蠕蠕：“柔然”的别称，亦称“芮芮”、“茹茹”。古代北方少数民族名。",
        "&emsp;&#10020;高车：亦称“狄历”、“敕勒”、“铁勒”、“丁零”。 古代北方少数民族名。",
        ],
    },
    {
        summary: "京都",
        paragraphs: [
        "&#10022;京都(jīng dū)：京师，即帝王的都城。始称于晋，因景王(司马师)讳'师'，故称'京师'为'京都'。",
        "&#10022;清·钱大昕《廿二史考异·三国志一》：“黄初元年，京都有事于太庙。”晋史臣避景帝（司马师）讳，称京师为京都。",
        ],
    },
    {
        summary: "礼贤下士",
        paragraphs: [
        "&#10022;礼贤下士(lǐ xián xià shì)：对贤者以礼相待；对学者非常尊敬。旧时形容封建君主或官员尊敬、重视人才。​",
        "&#10022;语出北宋《新唐书·李勉传》：其在朝廷，鲠亮谦介，为宗臣表，礼贤下士有终始，尝引李巡、张参在幕府。",
        ],
    },
    {
        summary: "一箭之远",
        paragraphs: [
        "&#10022;一箭之远(yī jiàn zhī yuǎn)：一箭的射程。比喻不太远的距离。​",
        "&#10022;语或本“一箭之地”。元·无名氏《博望烧屯》：放我一箭之地，埋锅造饭去。",
        ],
    },
    {
        summary: "垂花门",
        paragraphs: [
        "&#10148;[注解] 垂花门(chuí huā mén)：旧时四合院中内宅与外宅(前院)的分界线和唯一通道。门上修建像屋顶样的盖。四角有下垂的短柱，因其不落地，垂吊在屋檐下，称为“垂柱”。柱上通常彩绘、雕绘花瓣，故被称为“垂花门”。亦称“垂花二门”。",
        ],
        images: [
        "../../_Images/003_ChuiHuaMen_1.png",
        "../../_Images/003_ChuiHuaMen_2.png",
        "../../_Images/003_ChuiHuaMen_3.png",
        ],
    },
    {
        summary: "超手游廊",
        paragraphs: [
        "&#10148;[注解] 超手游廊(chāo shǒu yóu láng)：亦作“超手回廊”、“抄手游廊”。回廊的一种式样。即左右两侧环抱的走廊。",
        ],
        images: [
        "../../_Images/003_ChaoShouYouLang_1.png",
        "../../_Images/003_ChaoShouYouLang_2.png",
        ],
    },
    {
        summary: "雕梁画栋",
        paragraphs: [
        "&#10022;雕梁画栋(diāo liáng huà dòng)：指房屋有十分华丽的彩绘装饰。形容房屋富丽堂皇。​",
        "&#10022;语出元·郑廷玉《看钱奴》第三折：这的是雕梁画栋圣祠堂。",
        ],
    },
    {
        summary: "穿山游廊",
        paragraphs: [
        "&#10148;[注解] 穿山游廊(chuān shān yóu láng)：指与厅房两边山墙门通连的回廊。",
        ],
    },
    {
        summary: "顾盼神飞",
        paragraphs: [
        "&#10022;顾盼神飞(gù pàn shén fēi)：左右顾视，目光炯炯，神采飞扬。​",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "身量未足，形容尚小",
        paragraphs: [
        "&#10148;[注解] “惜春”的形象：年纪尚轻，身材和容貌都还没有发育成熟。​",
        ],
    },
    {
        summary: "弱不胜衣",
        paragraphs: [
        "&#10022;弱不胜衣(ruò bù shèng yī)：瘦弱得连衣服都承受不了。形容人身材瘦弱、虚弱。​",
        "&#10022;语出先秦·荀况《荀子·非相》：叶公子高微小短瘠，行若将不胜其衣。",
        ],
    },
    {
        summary: "疯疯癫癫",
        paragraphs: [
        "&#10022;疯疯癫癫(fēng fēng diān diān)：精神失常的样子。形容人言语行动轻狂或超出常态。​",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "不经之谈",
        paragraphs: [
        "&#10022;不经之谈(bù jīng zhī tán)：指荒唐的没有根据的言论。​",
        "&#10022;语出晋·羊祜《诫子书》：无传无经之谈，无听毁誉之语。",
        ],
    },
    {
        summary: "人参养荣丸",
        paragraphs: [
        "&#10148;[注解] 人参养荣丸：以人参、当归、黄芪、陈皮、白芍、熟地、桂心等配制而成的丸药，主治脾胃气血亏虚等症。​",
        "&emsp;&#10020;荣：中医指血脉。",
        "&emsp;&#10020;林黛玉的“养荣丸”和薛宝钗的“冷香丸”相对，以寓二人的不同性格。​",
        ],
    },
    {
        summary: "敛声屏气",
        paragraphs: [
        "&#10022;敛声屏气(liǎn shēng bǐng qì)：抑制语声和呼吸。形容畏惧、小心的样子。​",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "八宝",
        paragraphs: [
        "&#10148;[注解] 八宝(bā bǎo)：梵语aṣṭa-maṅgala，亦作“八瑞相”、“八吉祥”。指佛教中八种象征吉庆祥瑞、圆满、幸福的法物。分别是法螺、吉祥结(盘长)、双鱼、莲花、宝瓶、伞盖、法轮、法幢。​",
        ],
        images: [
        "../../_Images/003_BaBao.png",
        "../../_Images/003_BaBao_FaLuo.png",
        "../../_Images/003_BaBao_PanChang.png",
        "../../_Images/003_BaBao_ShuangYu.png",
        "../../_Images/003_BaBao_LianHua.png",
        "../../_Images/003_BaBao_BaoPing.png",
        "../../_Images/003_BaBao_SanGai.png",
        "../../_Images/003_BaBao_FaLun.png",
        "../../_Images/003_BaBao_FaChuang.png",
        ],
    },
    {
        summary: "五凤",
        paragraphs: [
        "&#10148;[注解] 五凤(wǔ fèng)：指凤凰的五个种类：凤，鹓雏，鸑鷟，青鸾，鸿鹄。​",
        "&#10022;《永乐大典》：(汉)太史令蔡衡曰：凡像凤者有五色，多赤者凤，多青者鸾，多黄者鹓鶵，多紫者鸑鷟，多白者鸿鹄。",
        "&emsp;&#10020;鸑鷟(yuè zhuó):[名] 传说中的五凤之一。身为黑色或紫色。象征着祥瑞、坚贞不屈的品质、名臣贤士。",
        "&emsp;&#10020;青鸾(qīng luán):[名] 又称“苍鸾”，传说中的五凤之一。古人视赤色者为凤，青色多者为鸾。是祥和、喜庆的瑞兆。",
        "&emsp;&#10020;鸿鹄(hóng hú):[名] 传说中的五凤之一。指白色的凤凰。是纯洁、善良、高尚、勇敢的象征。",
        "&emsp;&#10020;鹓鶵(yuān chū):[名] 传说中的五凤之一。古代传说中与鸾凤同类的鸟。",
        "&emsp;&#10020;凤(fèng):[名] “凤凰”的简称，神话传说中的百鸟之王。雄的称凤，雌的称凰，通称凤。头似锦鸡、身如鸳鸯，有大鹏的翅膀、仙鹤的腿、鹦鹉的喙、孔雀的尾。是封建时代吉瑞的象征，亦是皇后的代称。",
        ],
    },
    {
        summary: "仪门",
        paragraphs: [
        "&#10022;仪门(yí mén)：原指官署大门里的第二道正门，官员至此门必须整齐仪表。后大家府第的第二道正门也称仪门。​",
        "&#10022;《明会典·礼部十七·官员礼》：新官到任之日……先至神庙祭祀毕，引至仪门前下马，具官服，从中道入。",
        "&#10022;《江宁府志·建制·官署》：其制大门之内为仪门，仪门内为莅事堂。",
        ],
    },
    {
        summary: "小巧别致",
        paragraphs: [
        "&#10022;小巧别致(xiǎo qiǎo bié zhì)：体积小而精细，式样新奇。​",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "鹿顶",
        paragraphs: [
        "&#10022;鹿顶(lù dǐng)：亦作“盝(lù)顶”。即平屋顶。旧式四合院，东西向房屋和南北向房屋连接转角的地方。",
        ],
    },
    {
        summary: "耳房",
        paragraphs: [
        "&#10022;耳房(ěr fáng)：紧靠正房或厢房两侧并利用其山墙建造的房屋。因其位于正房两侧，犹如人的两只耳朵，故称。",
        ],
    },
    {
        summary: "四通八达",
        paragraphs: [
        "&#10022;四通八达(sì tōng bā dá)：四面八方都有路可通。形容道路、交通便利。​",
        "&#10022;语出《子华子·晏子问党》：其涂之所出，四通而八达，游士之所凑也。​",
        ],
    },
    {
        summary: "九龙",
        paragraphs: [
        "&#10022;九龙(jiǔ lóng)：古代传说龙生九子，性格各异。对一门九子的美称，用以饰为祥瑞。",
        "&emsp;&#10020;但“九龙”的说法在古代并不统一，各个时期的不同人物对九龙的说法也不尽相同。",
        "&emsp;&#10020;明·杨慎《升庵外集·动物一·龙生九子》说：龙生九子不成龙，各有所好：囚牛，平生好音乐，今胡琴头上刻兽是其遗像；睚毗，平生好杀，金刀柄上龙吞口是其遗像；嘲风，平生好险，今殿角走兽是其遗像；蒲牢，平生好鸣，今钟上兽纽是其遗像；狻猊，平生好坐，今佛座狮子是其遗像；霸下，平生好负重，今碑座兽是其遗像；陛犴，平生好讼，今狱门上狮子头是其遗像；屓屭，平生好文，今碑两旁龙是其遗像；蚩吻，平生好吞，今殿脊兽头是其遗像。",
        "&emsp;&#10020;明·焦竑《玉堂丛语·卷一·文学》则说：俗传龙生九子不成龙，各有所好……一曰赑屭，形似龟，好负重，今石碑下龟趺是也；二曰螭吻，形似兽，性好望，今屋上兽头是也；三曰蒲牢，形似龙而小，性好叫吼，今钟上纽是也；四曰狴犴，形似虎，有威力，故立于狱门；五曰饕餮，好饮食，故立于鼎盖；六曰𧈢𧏡，性好水，故立于桥柱；七曰睚毗，性好杀，故立于刀环；八曰金猊，形似狮，性好烟火，故立于香炉；九曰椒图，形似螺蚌，性好闭，故立于门铺首。",
        "&emsp;&#10020;明·沈德符《万历野获编·卷七·内阁·龙子》：长沙李文正公在阁，孝宗忽下御札，问龙生九子之详。文正对云：“其子蒲牢好鸣，今为钟上钮鼻；囚牛好音，今为胡琴头刻兽；睚眦好杀，今为刀剑上吞口；嘲风好险，今为殿阁走兽；狻猊好坐，今为佛座骑象；霸下好负重，今为碑碣石趺；狴犴好讼，今为狱户首镇压；屓屭好文，今为碑两旁蜿蜒；蚩吻好吞，今为殿脊兽头。”",
        "&emsp;&#10020;此外，明·陈仁锡《潜确类书》、明·胡侍《真珠船·龙生九子》、清·褚人获《坚瓠十集·龙九子》、清·高士奇《天禄识馀·龙种》，对九龙的名称、性格、用途的说法也各不相同。世人多用作装饰，以示祥瑞。​",
        ],
    },
    {
        summary: "万幾",
        paragraphs: [
        "&#10022;万幾(wàn jī)：指国家纷繁复杂的政务。亦称“万机”。",
        "&#10022;典出《尚书·虞书·皋陶谟》：兢兢业业，一日二日万幾。孔颖达传云：“幾，微也，言当戒惧万事之微。”。",
        "&#10022;典出《汉书·百官公卿表上》：相国、丞相皆秦官，金印紫绶，掌丞天子，助理万机。",
        ],
    },
    {
        summary: "黼黻",
        paragraphs: [
        "&#10022;黼黻(fǔ fú)：泛指绣有华美花纹的礼服。",
        "&#10022;《晏子春秋·谏下十五》：公衣黼黻之衣，素绣之裳，一衣而王采具焉。",
        ],
    },
    {
        summary: "汝窑",
        paragraphs: [
        "&#10022;汝窑(rǔ yáo)：即北宋汝州瓷窑。因其青瓷器皿质量特佳，多为贡品，故名闻天下，后世成为收藏珍品。",
        ],
    },
    {
        summary: "斋戒",
        paragraphs: [
        "&#10022;斋戒(zhāi jié)：在祭祀或举行重要典礼之前，沐浴更衣，不饮酒，不吃荤，夫妻不同房，严守戒律，以示虔诚庄敬。",
        "&#10022;《史记·卷八一·廉颇蔺相如传》：赵王送璧时，斋戒五日，今大王亦宜斋戒五日，设九宾于廷，臣乃敢上璧。",
        ],
    },
    {
        summary: "孽根祸胎",
        paragraphs: [
        "&#10022;孽根祸胎(niè gēn huò tāi)：灾祸的根源。旧指坏的儿子。​",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "混世魔王",
        paragraphs: [
        "&#10022;混世魔王(hùn shì mó wáng)：比喻扰乱人世的凶人或骄纵恣肆的人。",
        "&#10022;语出《红楼梦》。",
        ],
    },
    {
        summary: "还愿",
        paragraphs: [
        "&#10022;还愿(huán yuàn)：偿还对神许下的诺言。求神以后，得遂所愿，就照当初的许诺来谢神。",
        "&#10022;元·无名氏《看钱奴·第三折》：庙官哥哥，俺两口儿一径来还愿的，赶烧炷儿头香，暂借一坨儿田地，与我歇息咱。",
        ],
    },
    {
        summary: "甜言蜜语",
        paragraphs: [
        "&#10022;甜言蜜语(tián yán mì yǔ)：说的话像蜜糖一样甜。后比喻动听而骗人的话。",
        "&#10022;语出《敦煌变文集·捉季布传文》：季布得之心中怕，甜言蜜语却安存。",
        ],
    },
    {
        summary: "有天没日",
        paragraphs: [
        "&#10022;有天没日(yǒu tiān méi rì)：比喻说话毫无畏惧和顾忌。​",
        "&#10022;语出明·兰陵笑笑生《金瓶梅词话》第12回：拿这有天没日头的事压枉奴。就是你与的簪子，都有数儿，一五一十都在。",
        ],
    },
    {
        summary: "总角",
        paragraphs: [
        "&#10022;总角(zǒng jiǎo)：旧时未成年男女，编扎头发，梳成两个发髻，如头顶两角。故用以指未成年的男女。后代称童年时期，幼年时代。",
        "&#10022;晋·陶潜《荣木》：总角闻道，白首无成。",
        ],
    },
    {
        summary: "《四书》",
        paragraphs: [
        "&#10022;《四书》即《论语》、《孟子》、《大学》、《中庸》。",
        "&emsp;&#10020;《大学》、《中庸》：原为《礼记》中的两篇。",
        "&#10022;宋代朱熹选定并定名《四书》，遂成为元、明、清三代科举考试的必读之书。​",
        ],
    },
    {
        summary: "抹额",
        paragraphs: [
        "&#10022;抹额(mò é)：原指束在额上的头巾，为军人的标志。后平民以布巾束发，富人用金箍束发，兼为头饰。​",
        "&#10022;宋·高承《事物纪原·戎容兵械·抹额》引《二仪实录》曰：禹娶涂山之夕，大风雷电，中有甲卒千人，其不披甲者，以红绡帕抹其头额，云海神来朝。禹问之，对曰：“此武士之首服也。”秦始皇至海上，有神朝，皆抹额、绯衫、大口袴。侍卫自此抹额，遂为军容之服。",
        ],
    },
    {
        summary: "箭袖",
        paragraphs: [
        "&#10022;箭袖(jiàn xiù)：亦称“箭衣”。一种窄袖长袍，其袖口呈斜切状，朝手背的袖口长，朝手心的袖口短，便于射箭，故名。​其斜袖口又形似马蹄，故又称“马蹄袖”。后成为一种服式，不射箭的男子也穿。",
        "&#10022;清·张照《劝善金科·第十六出·鬼魅仗钟馗》：净扮锺馗戴锺馗帽，穿圆领，扎角带，持笏从上场门上跳舞科杂扮四小鬼各戴鬼发，穿箭袖虎皮卒褂。",
        ],
    },
    {
        summary: "寄名锁",
        paragraphs: [
        "&#10022;寄名锁(jì míng suǒ)：旧时父母为保佑幼儿长命百岁，在神或僧﹑道前作“寄名”弟子，再用锁形饰物挂在项间谓之“寄名锁”。",
        ],
    },
    {
        summary: "护身符",
        paragraphs: [
        "&#10022;护身符(hù shēn fú)：一种小巧的装饰品(如珠宝、玉石或纪念品)，上面刻有符咒、咒文或符号，用以辟邪消灾、防止灾祸(如疾病或魔力)。​",
        "&#10022;元·耶律楚材《湛然居士集·答倪公故人》：玉泉回报故人书，问子参玄著意无。且趁万松炉鏊热，疾忙索取护身符。​",
        ],
    },
    {
        summary: "面如傅粉",
        paragraphs: [
        "&#10022;面如傅粉(miàn rú fù fěn)：原指何晏的脸上好像抹了香粉般洁白。引申以泛喻男子姿容洁白秀美。",
        "&#10022;语出南朝宋·刘义庆《世说新语·容止》：何平叔(晏)美姿仪，面至白。魏明帝疑其傅粉，正夏月，与热汤饼。既啖，大汗出，以朱衣自拭，色转皎然。",
        ],
    },
    {
        summary: "《西江月》",
        paragraphs: [
        "&#10022;《西江月》：词牌之一。",
        "&#10022;每个词牌都有字数、句数、韵脚等规定，还有双调、长调、小令之别。",
        "&emsp;&#10020;词：原本指歌曲中的文词，后来文词与曲调分离，遂变成文体之一。",
        ],
    },
    {
        summary: "不肖",
        paragraphs: [
        "&#10022;不肖(bù xiào)：不成材、没有才能。",
        "&#10022;《礼记·射义》：“发而不失正鵠者，其唯贤者乎？若夫不肖之人，则彼将安能以中。”孔颖达疏：“不肖，谓小人也。”。",
        ],
    },
    {
        summary: "纨袴",
        paragraphs: [
        "&#10022;纨袴(wán kù)：原意为细绢制的裤子。泛指华美的衣着。借指富贵人家子弟。",
        "&#10022;《汉书·叙传上》：“数年，金华之业绝，出与王、许子弟为群，在于绮襦纨裤之间，非其好也。”颜师古注：“纨，素也。绮，今细绫也。并贵戚子弟之服。”。",
        "&#10022;唐·杜甫《奉赠韦左丞丈二十二韵》：纨袴不饿死，儒冠多误身。",
        ],
    },
    {
        summary: "袅袅婷婷",
        paragraphs: [
        "&#10022;袅袅婷婷(niǎo niǎo tíng tíng)：形容女子体态秀美，姿态柔美。​",
        "&#10022;语出元·王实甫《西厢记》第一本第三折：等待那齐齐整整，袅袅婷婷，姐姐莺莺。",
        ],
    },
    {
        summary: "比干",
        paragraphs: [
        "&#10022;比干(bǐ gān)：古代商纣王时的贤臣，被誉为圣人。​",
        "&#10022;战国·庄周《南华真经》：世之所谓忠臣者，莫若王子比干、伍子胥子，胥沉江，比干剖心。​",
        ],
    },
    {
        summary: "窍",
        paragraphs: [
        "&#10022;窍(qiào)：即“心窍”，也作“心孔”。指人的认知和思维能力(古人认为心脏有窍、能思考)。亦即“心思”、“心智”。",
        "&#10022;元·耶律楚材《湛然居士集·弹秋水》：信意弹秋水，清商促轸成。只疑天上曲，不似世间声。海若诚无敌，河神已请平。三朝不弹此，心窍觉尘生。",
        ],
    },
    {
        summary: "西子",
        paragraphs: [
        "&#10022;西子(xī zǐ)：即春秋越国美女“西施”。后用作美女的代称。​",
        "&#10022;《庄子·天运》：故西施病心而颦其里，其里之丑人见而美之，归亦捧心而颦其里。其里之富人见之，坚闭门而不出；贫人见之，挈妻子而去之走。​",
        ],
    },
    {
        summary: "面善",
        paragraphs: [
        "&#10022;面善(miàn shàn)：面貌熟识，即面熟。",
        "&#10022;《礼记·学记》：不陵节而施之谓孙(逊)，相观而善之谓摩。孔颖达疏：“善，犹解也。”。",
        ],
    },
    {
        summary: "表字",
        paragraphs: [
        "&#10022;表字(biǎo zì​)：旧时人在本名以外所起的表示德行或本名的意义的名字。",
        "&emsp;&#10020;古代男子20岁女子15岁，不便直呼其名。故另取一与本名涵义相关的别名，称之为字，以表其德。",
        "&#10022;宋·张世南《游宦纪闻》：昔人有诫后生不可称前辈表字，此忠厚之至也。然一时出于中心至诚，未尝深考。字所以表德也，古人以为美称，殷人以为讳，事神而后有字。",
        ],
    },
    {
        summary: "西方",
        paragraphs: [
        "&#10022;西方：指佛家理想中的西方极乐世界，即所谓“佛国”，又称“西方净土”、“西方净国”、“西方世界”、“极乐土”。​",
        "&#10022;《佛说阿弥陀经》：从是西方，过十万亿佛土，有世界名曰极乐……彼土何故名为极乐？其国众生无有众苦，但受诸乐，故名极乐。",
        ],
    },
    {
        summary: "《古今人物通考》",
        paragraphs: [
        "&#10022;[注解]：曹雪芹杜撰。",
        ],
    },
    {
        summary: "教引嬷嬷",
        paragraphs: [
        "&#10022;教引嬷嬷(jiāo yǐn mó mó)：清代专司教导年幼皇子的女子，称“谙达”。后世家大族也仿效而行。​",
        ],
    },
    {
        summary: "花气袭人",
        paragraphs: [
        "&#10022;花气袭人(huā qì xí rén)：意为花香扑鼻。​",
        "&#10022;语出宋·陆游《村居书喜》：红桥梅市晓山横，白塔樊江春水生。花气袭人知骤暖，鹊声穿树喜新晴。坊场酒贱贫犹醉，原野泥深老亦耕。最喜先期官赋足，经年无吏叩柴荆。​",
        ],
    },
    {
        summary: "省",
        paragraphs: [
        "&#10022;省(xǐng)：即“晨省”，指子女早晨向父母请安问候的礼节。​",
        "&#10022;典出《礼记·曲礼上》：凡为人子之礼，冬温而夏凊，昏定而晨省。​",
        ],
    }
    
    // new references
]
