const tooltips = {
    // // 字
    // "那": "&#9752;那(nà): [代] 指较远的时间、地点或人、事、物。&#10;&#9752;那(nǎ): [代] 古同'哪'，表示疑问。",
    // "堪": "&#9752;堪(kān): &#10;&emsp;&#10022;[动] 能够、足够；可以，配得上；承受的起。&#10;&emsp;&#10022;[动] 承受；忍受；遭受。",
    
    // // 词
    // "毵毵": "&#9752;毵毵(sān sān): [形] 毛发、枝条等细长垂拂、散乱的样子。",
    // "须眉": "&#9752;须眉(xū méi): [名] 胡须和眉毛。借指男子。",
    // "胡人": "&#9752;胡人(hú rén): [名] 古代中原人对北方游牧民族的称谓。",
    // "却说": "&#9752;却说(què shuō): [助] 说书人或章回小说中，在新段落常用的发端词。",
    // "玛瑙": "&#9752;玛瑙(mǎ nǎo): [名] 矿物名。颜色光美、有层次，可制器皿及装饰品。",
    // "般若": "&#9752;般若(bō rě): [名] 佛教用语，梵语prajna的音译。指如实认知一切事物和万物本源的智慧。",
    // "翛然": "&#9752;翛然(xiāo rán): [形] 无拘无束的样子；超脱凡俗的样子。",
    // "头陁": "&#9752;头陁(tóu tuó): [名] 佛教用语，梵语dhūta的音译。头陀是佛教僧侣的一种修行方式，因用以称僧人。亦专指行脚乞食的僧人。",
}