const tooltips = {
    "禀": "&#9752;禀(bǐng):[动] 赐予；给予。",
    "颊": "&#9752;颊(jiá):[名] 脸的两侧。",
    "瞥": "&#9752;瞥(piē):[动] 短时间地粗略的看。",
    "搡": "&#9752;搡(sǎng):[动] 推；挤。",
    "龇": "&#9752;龇(zī):[动] 张开嘴露出牙齿。",
    "咧": "&#9752;咧(liě):[动] 嘴角向两边伸展。",
    "掳": "&#9752;掳(lǔ):[动] 抢取、抢夺。",
    "冕": "&#9752;冕(miǎn):[名] 古代帝王、诸侯等所戴的礼帽。也专指帝王的皇冠。",
    "妲": "&#9752;妲(dá):[名] 女子人名用字。",
    "蜷": "&#9752;蜷(quán):[动] (肢体）弯曲，不伸展。",
    "戮": "&#9752;戮(lù):[动] 斩；杀。",
    "觑": "&#9752;觑(qù):[动] 瞧；看。",
    "颌": "&#9752;颌(hé):[名] 构成口腔上下部的骨骼和肌肉组织。",

    "摩挲": "&#9752;摩挲(mó suō):[动] 用手抚摸、抚摩。",
    "翩跹": "&#9752;翩跹(piān xiān):[形] 轻快地旋转舞动的样子。",
    "嘟囔": "&#9752;嘟囔(dū nang):[动] 不断地、含混地自言自语。",
    "调侃": "&#9752;调侃(tiáo kǎn):[动] 言语揶揄、嘲讽、挖苦。",
    "僻壤": "&#9752;僻壤(pì rǎng):[名] 偏远或人烟稀少的地区。",
    "腕尺": "&#9752;腕尺(wàn chǐ):[名] 测量单位。一个希腊腕尺约46.38厘米；一个罗马腕尺约44.37厘米。",
    
    "打牙祭": "&#9752;打牙祭(dǎ yá jì):[动] 享用久未曾吃的、丰盛的菜肴。",
    

    "噼哩乓啷": "&#9752;噼哩乓啷(pī lǐ pāng lāng):[形] 连续不断的爆裂、拍打或东西撞击等的声音。",

}